In [15]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt
from tqdm import tqdm
import ast
import seaborn as sns

#loading data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#data cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])
df['job_skills'] = df['job_skills'].apply(lambda x: ast.literal_eval(x) if isinstance(x, str) else x)

In [16]:
df_US = df[df['job_country'] == 'United States']

In [22]:
df_skills = df_US.explode('job_skills')
df_skills[['job_title_short','job_skills']]

             job_title_short job_skills
0       Senior Data Engineer       None
3              Data Engineer     python
3              Data Engineer        c++
3              Data Engineer       java
3              Data Engineer     matlab
...                      ...        ...
785692        Data Scientist          r
785703          Data Analyst       None
785705          Data Analyst        sql
785705          Data Analyst     python
785705          Data Analyst    tableau

[1073565 rows x 2 columns]

In [26]:
df_skills_count = df_skills.groupby(['job_title_short','job_skills']).size()
df_skills_count = df_skills_count.reset_index(name='skill_count')
df_skills_count.sort_values(by='skill_count',ascending=False,inplace=True)
df_skills_count

           job_title_short job_skills  skill_count
886         Data Scientist     python        42379
472           Data Analyst        sql        34452
921         Data Scientist        sql        30034
351           Data Analyst      excel        27519
890         Data Scientist          r        26022
...                    ...        ...          ...
1350  Senior Data Engineer     elixir            1
1819     Software Engineer       sass            1
487           Data Analyst     theano            1
1847     Software Engineer     theano            1
6         Business Analyst       arch            1

[1870 rows x 3 columns]